app/Http/Controllers/Post_Controller.php

    public function index() {
        $post = Post::latest()->with(['user', 'likes'])->paginate(5); //$post = Post::get(); //get all the posts in laravel collections
---
select * from `likes` where `likes`.`post_id` in (224, 225, 226, 227) and `likes`.`deleted_at` is null
select * from `posts` order by `created_at` desc limit 5 offset 0
select * from `users` where `users`.`id` in (8, 9, 10)
select count(*) as aggregate from `posts`